jack77er/openUTRUSTA/Packages/.cache/Infineon.TLE987x_DFP.1.2.1.pdsc
    <condition id="TLE9879QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9879QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9879QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9879QXA40 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9871 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9871 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9871QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9877 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9877 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9877QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9879 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9879 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  </conditions>

   <boards>
    <board vendor="Infineon" name="TLE9879 EvalKit" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9879 EvalKit Board Support and Examples</description>
      <image small="Images\TLE9879_EvalKit_v1_top_small.jpg" large="Images\TLE9879_EvalKit_v1_top_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9879+EVALKIT/evaluation-boards/TLE9879+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9879 EvalKit Web Page"/>
      <book category="setup"     name="Documents\TLE9879-EvalKit-UM-110-Infineon.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents\TLE9879_EvalKit_1.0.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9879QXA40"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series"/>
  	    <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
	    <feature type="PWR"       n="5"              name="USB Powered"/>
	    <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
	    <feature type="DIO"       n="13"             name="Pins at pin headers"/>
	    <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
	    <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TLE987x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE987x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TLE987x.s" condition="TLE9871 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE987x.s" condition="TLE9877 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE987x.s" condition="TLE9879 ARM" version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_TLE987x.c" condition="TLE9871 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE987x.c" condition="TLE9877 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE987x.c" condition="TLE9879 ARM" version="1.1"/>

        <file category="include" name="Device\SDK\cfgwiz\TLE9871QXA20\" condition="TLE9871QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9871QXA20\" condition="TLE9877QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9877QXA40\" condition="TLE9877QXA40"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9879QXA20\" condition="TLE9879QXA20"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9879QXA40\" condition="TLE9879QXA40"/>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\bsl_defines.h" attr="config" condition="TLE9871QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\bsl_defines.h" attr="config" condition="TLE9877QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\bsl_defines.h" attr="config" condition="TLE9877QXA40" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\bsl_defines.h" attr="config" condition="TLE9879QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\bsl_defines.h" attr="config" condition="TLE9879QXA40" version="1.8"/>      

        <file category="sourceC" name="Device\SDK\app\main.c" attr="template" select="Simple Main" condition="TLE987x" version="1.8"/> 		
     </files>
    </component>

	<!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.2" condition="TLE987x">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <files>
        <file category="source" name="Device\SDK\cfgwiz\TLE9871QXA20\config.icwp" attr="config" condition="TLE9871QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9877QXA20\config.icwp" attr="config" condition="TLE9877QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9877QXA40\config.icwp" attr="config" condition="TLE9877QXA40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9879QXA20\config.icwp" attr="config" condition="TLE9879QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9879QXA40\config.icwp" attr="config" condition="TLE9879QXA40" version="1.8.2"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\scu_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\scu_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\scu_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\scu_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\scu_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\pmu_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\adc1_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\adc1_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\adc1_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\adc1_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\adc2_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\adc2_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\adc2_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\adc2_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\adc2_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\bdrv_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\ccu6_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\ccu6_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\ccu6_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\ccu6_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\ccu6_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\csa_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\gpt12e_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\gpt12e_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\gpt12e_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\gpt12e_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\gpt12e_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\ssc_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\ssc_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\ssc_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\ssc_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\ssc_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\timer2x_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\timer2x_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\timer2x_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\timer2x_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\timer2x_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\timer3_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\timer3_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\timer3_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\timer3_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\timer3_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9871QXA20\uart_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA20\uart_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9877QXA40\uart_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA20\uart_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9879QXA40\uart_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\dma_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
     </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.2.7" condition="TLE987x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\scu.c"/>      
      </files>
    </component>

