jack77er/openUTRUSTA/Packages/.cache/Infineon.TLE987x_DFP.1.2.1.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.0" condition="TLE987x CMSIS Device">
      <description>BootROM driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\bootrom.c" />      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.4" condition="TLE987x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\wdt1.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.1" condition="TLE987x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\pmu.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.1.3" condition="TLE987x CMSIS Device">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\adc1.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.3" condition="TLE987x CMSIS Device">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\adc2.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BDRV" Cversion="0.3.2" condition="TLE987x CMSIS Device">
      <description>Bridge Driver (BDRV) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\bdrv.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.2" condition="TLE987x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\ccu6.c"/>      
  	  </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CSA" Cversion="0.1.1" condition="TLE987x CMSIS Device">
      <description>Current Sense Amplifier (CSA) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\csa.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.3" condition="TLE987x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\gpt12e.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.2" condition="TLE987x CMSIS Device">
      <description>Interrupt (INT) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\int.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.1.4" condition="TLE987x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\isr.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.3" condition="TLE987x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\lin.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.1" condition="TLE987x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\mon.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.5.1" condition="TLE987x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\port.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.1.2" condition="TLE987x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\ssc.c"/>
      </files>
    </component>

